import json
import time
import requests
import streamlit as st

st.set_page_config(
    page_title="Prakit Junkhum 633230010 24.2",
    page_icon= ":bar_chart:",
)

st.image('./images/header.jpg')
st.sidebar.markdown("# Theory 🗂")

st.title("ทฤษฎี")
st.write("")
st.write('''เบาหวานชนิดที่ 2 เป็นโรคเรื้อรังที่เกิดจากร่างกายไม่สามารถผลิตอินซูลินได้เพียงพอ หรือไม่สามารถตอบสนองต่ออินซูลินได้อย่างมีประสิทธิภาพ 
    อินซูลินเป็นฮอร์โมนที่ช่วยให้น้ำตาลเข้าสู่เซลล์เพื่อให้ร่างกายน้ำไปใช้เป็นแหล่งพลังงาน เมื่อร่างกายไม่สามารถผลิตอินซูลินได้เพียงพอหรือไม่สามารถตอบสนองต่ออินซูลินได้อย่างมีประสิทธิภาพ 
    น้ำตาลจะสะสมในเลือด ซึ่งอาจนำไปสู่ปัญหาสุขภาพต่างๆ เช่น โรคหัวใจ โรคหลอดเลือดสมอง โรคไต และโรคตา อาการของโรคเบาหวานชนิดที่ 2 มักไม่ปรากฏชัดเจนในช่วงแรก 
	อาการที่พบบ่อยได้แก่ ปัสสาวะบ่อย กระหายน้ำบ่อย น้ำหนักลดโดยไม่ทราบสาเหตุ เหนื่อยล้า มองเห็นภาพซ้อน แผลหายช้า 
	ปัจจัยที่เสี่ยงในการเป็นโรคเบาหวานชนิดที่ 2 ได้แก่ อายุ น้ำหนักเกินหรือโรคอ้วน ประวัติครอบครัว ภาวะแทรกซ้อนขณะตั้งครรภ์ ประวัติโรคเบาหวานชนิดที่ 2 
	การรักษาโรคเบาหวานชนิดที่ 2 มีวัตถุประสงค์เพื่อควบคุมระดับน้ำตาลในเลือดให้อยู่ในระดับปกติ การรักษาประกอบด้วย การควบคุมอาหาร การออกกำลังกาย และการใช้ยา 
	ภาวะแทรกซ้อนจากโรคเบาหวานชนิดที่ 2 ได้แก่ โรคหัวใจ โรคหลอดเลือดสมอง โรคไต โรคตา โรคประสาท
	การป้องกันโรคเบาหวานชนิดที่ 2 ทำได้โดยการ ควบคุมน้ำหนัก ออกกำลังกายเป็นประจำ รับประทานอาหารที่มีกากใยสูง ไขมันต่ำ และโปรตีนปานกลาง ตรวจสุขภาพเป็นประจำ 
    ''')

st.title("เทคนิกการจำแนกข้อมูล")

col1, col2, col3 = st.columns(3)
col1.write('การจำแนกด้วยวิธี KNN')
col2.write('การจำแนกด้วยวิธี Naïve Bayes')
col3.write('การจำแนกด้วยวิธี Decision Tree')

# Three columns with different widths
col1, col2, col3 = st.columns([3,3,3])
# col1 is wider

# Using 'with' notation:
with col1:
    st.write('''K-NN (K-nearest Neighbor) คือ วิธีการหาสมาชิกที่มีความคล้ายคลึงกันมากที่สุด โดยการหาค่าระยะห่างระหว่างข้อมูล (Standard Euclidean Distance) [3] เป็นอัลกอริทึมหนึ่งที่สามารถใช้งานได้ดีเพื่อเติมเต็มข้อมูลที่ขาดหายไป ใช้หลักการวัดระยะห่าง ระหว่างข้อมูลขาดหายกับข้อมูลแต่ละตัว แล้วประมาณค่าที่ขาดหายไปด้วยค่าเฉลี่ยของข้อมูลที่ใกล้ที่สุดจำนวน k ตัว นิยมใช้การคำนวณระยะทางแบบยูคลิเดียน (Euclidean Distance) นั่นคือ ถ้า d เป็นระยะห่างระหว่างจุด (x1, y1) และ (x2, y2) จะได้ ''')
    st.image('./images/knn.jpg')
with col2:
    st.write('''K-NN (K-nearest Neighbor) คือ วิธีการหาสมาชิกที่มีความคล้ายคลึงกันมากที่สุด โดยการหาค่าระยะห่างระหว่างข้อมูล (Standard Euclidean Distance) [3] เป็นอัลกอริทึมหนึ่งที่สามารถใช้งานได้ดีเพื่อเติมเต็มข้อมูลที่ขาดหายไป ใช้หลักการวัดระยะห่าง ระหว่างข้อมูลขาดหายกับข้อมูลแต่ละตัว แล้วประมาณค่าที่ขาดหายไปด้วยค่าเฉลี่ยของข้อมูลที่ใกล้ที่สุดจำนวน k ตัว นิยมใช้การคำนวณระยะทางแบบยูคลิเดียน (Euclidean Distance) นั่นคือ ถ้า d เป็นระยะห่างระหว่างจุด (x1, y1) และ (x2, y2) จะได้ ''')
    st.image('./images/knn.jpg')
with col3:
    st.write('''K-NN (K-nearest Neighbor) คือ วิธีการหาสมาชิกที่มีความคล้ายคลึงกันมากที่สุด โดยการหาค่าระยะห่างระหว่างข้อมูล (Standard Euclidean Distance) [3] เป็นอัลกอริทึมหนึ่งที่สามารถใช้งานได้ดีเพื่อเติมเต็มข้อมูลที่ขาดหายไป ใช้หลักการวัดระยะห่าง ระหว่างข้อมูลขาดหายกับข้อมูลแต่ละตัว แล้วประมาณค่าที่ขาดหายไปด้วยค่าเฉลี่ยของข้อมูลที่ใกล้ที่สุดจำนวน k ตัว นิยมใช้การคำนวณระยะทางแบบยูคลิเดียน (Euclidean Distance) นั่นคือ ถ้า d เป็นระยะห่างระหว่างจุด (x1, y1) และ (x2, y2) จะได้ ''')
    st.image('./images/knn.jpg')